{"data":{"allContentfulBlog":{"edges":[{"node":{"date":"27 July","main":"Content One","subName":"Stranger Things","paragraph":{"paragraph":"t's the fall of 1984, about a year after Will Byers was found, and he has been plagued by seeing visions of the Upside Down featuring a more dangerous monster. That leads the boy to see a suspiciously friendly new doctor, with the possibility that Will's visions are the result of suffering from PTS… Is Stranger Things scary, or what? ... However, while we acknowledge that everyone's tolerance level is different, the general consensus is that Stranger Things is more \"creepy\" than \"scary,\" and more \"thriller\" than \"horror.\" It has minimal levels of gore, so don't go into it expecting Saw or anything. "}}},{"node":{"date":"28 July","main":"Content 02","subName":"Money Heist","paragraph":{"paragraph":"A criminal mastermind who goes by \"The Professor\" has a plan to pull off the biggest heist in recorded history -- to print billions of euros in the Royal Mint of Spain. To help him carry out the ambitious plan, he recruits eight people with certain abilities and who have nothing to lose.\nIn the last episode of part four, Alicia betrays the police force and government by exposing all their illegal activities to the press, effectively ending her career and leading to a warrant for her arrest. The episode ends with her on the run and tracking down The Professor's hideout to hold him at gunpoint."}}},{"node":{"date":"29 July","main":"Content 03","subName":"Elite","paragraph":{"paragraph":"When three working-class teens enroll in an exclusive private school in Spain, the clash between them and the wealthy students leads to murder.\nNetflix's Elite is a gripping teen drama that revolves around a murder mystery while tackling a range of topics like homophobia, drug use, classism, religion, and sexuality. The drama has captivating audiences across the streaming platform. Here's why the show is worth watching sooner rather than later."}}}]}}}